<template>
	<div class="container mx-auto px-4">
		<div class="flex flex-wrap -mx-4 my-8">
			<div class="flex flex-col px-4 w-full md:w-1/2 mb-8" v-for="product in products">
				<div class="flex-1 p-4 shadow-full border-2">
					<h2 class="text-lg text-brand mb-2 border-r-4 pr-2 border-brand">{{ product.name }}</h2>
					<p>{{ product.description }}</p>
				</div>
			</div>
		</div>
	</div>
</template>

<script>
	export default {
		name: "Interior",
		data() {
			return {
				products: [
					{
						name: 'البلاتيني الممتاز 80 للدواخل',
						description: 'طبقة خارجية ممتازة توفر مقاومة استثنائية للبقع وتسمح بمسح البقع بسهولة بعيدًا عن السطح المطلي.'
					},
					{
						name: 'داخلي ممتاز',
						description: 'يوفر مقاومة متقدمة للبقع لمنع البقع المنزلية الشائعة. تتميز الطبقة الخارجية بإخفاء استثنائي مع توفير طبقة خارجية مقاومة للعفن. يساهم في تقليل الروائح المنزلية الشائعة وإنشاء بيئة أكثر جمالاً.'
					},
					{
						name: 'ابعاد',
						description: 'لون غني. تغطية استثنائية. متوفر بجميع الألوان، بما في ذلك لوحة حصرية من 208 ألوان بتصميم خاص.'
					},
					{
						name: 'البقاء الطويل',
						description: 'الدهان + Primer مع تقنية البقاء الطويل لا تستمر فقط بشكل جميل ، ولكنها تظل جميلة لفترة أطول.'
					},
					{
						name: 'مقاوم للرطوبة',
						description: 'تتطلب مناطق الرطوبة العالية في منزلك نوعًا مختلفًا من الطلاء، تم تصميم هذا الطلاء الممتاز لحماية الجدران من التعرض المتكرر للماء والرطوبة. بل وأفضل من ذلك، فهو يوفر أيضًا طبقة خارجية متينة للغاية ومقاومة للنقس مع تغطية وإخفاء متميزة تضمن أن تظل الطبقة النهائية جميلة لفترة أطول.'
					},
					{
						name: 'الخزانات و الابواب',
						description: 'تم تصميم هذه الدهانات لتلبية متطلبات هذه المشاريع الفريدة، فهي تتميز بالمتانة العالية ومقاومة والخدش والطقس.'
					},
					{
						name: 'دهان مختلط جاهز',
						description: 'يمثل الطلاء المختلط مسبقًا الطريقة المناسبة لإضافة الجمال إلى منزلك مع لوحة من الألوان الجذابة المناسبة لكل غرفة في المنزل. .'
					},
					{
						name: 'دهان بملمس (زخرفى)',
						description: 'حوّل أثاثك المستعمل إلى جديد و راقي مع الطلاء الزخرفى الذى يسمح لك بتحويل الأثاث اليومى إلى أعمال فنية جديدة.'
					},
					{
						name: 'تصميم داخلي تزييني فريد من الجرانيت',
						description: 'امنح جدرانك مظهرًا من الرخام, طبقات النسيج الغني بأبرز الألوان الفاتحة والداكنة بمجموعة من التصاميم الجمالية، بدءًا من الأناقة الفخمة ووصولاً إلى الأناقة فى المكاتب.'
					},

				]
			}
		}
	}
</script>